{"rogue":0,"ota":1,"update":2,"server":3,"intercepted":4,"firmware":5,"push":6,"targeting":7,"200":8,"vw":9,"id":10,"vehicles":11,"attacker":12,"used":13,"bgp":14,"hijack":15,"redirect":16,"traffic":17,"malicious":18,"host":19,"serving":20,"tampered":21,"image":22,"onboard":23,"signature":24,"verification":25,"detected":26,"mismatch":27,"aborted":28,"installation":29,"all":30,"affected":31,"units":32,"were":33,"compromised":34,"fleet":35,"left":36,"outdated":37,"version":38,"pending":39,"reissued":40,"remotely":41,"exploited":42,"buffer":43,"overflow":44,"cellular":45,"modem":46,"jeep":47,"cherokee":48,"tcu":49,"after":50,"gaining":51,"initial":52,"code":53,"execution":54,"threat":55,"actor":56,"attempted":57,"pivot":58,"can":59,"bus":60,"issue":61,"brake":62,"steering":63,"commands":64,"intrusion":65,"detection":66,"system":67,"flagged":68,"anomalous":69,"isolated":70,"before":71,"any":72,"vehicle":73,"control":74,"executed":75,"researcher":76,"demonstrated":77,"injection":78,"attack":79,"using":80,"obd":81,"ii":82,"dongle":83,"plugged":84,"during":85,"routine":86,"maintenance":87,"replayed":88,"recorded":89,"frames":90,"spoof":91,"wheel":92,"speed":93,"sensor":94,"readings":95,"causing":96,"abs":97,"module":98,"disable":99,"itself":100,"required":101,"physical":102,"access":103,"post":104,"diagnostic":105,"scan":106,"attackers":107,"relay":108,"amplify":109,"signal":110,"from":111,"key":112,"fob":113,"inside":114,"target":115,"home":116,"tricking":117,"pkes":118,"bmw":119,"series":120,"unlocking":121,"starting":122,"entire":123,"took":124,"under":125,"30":126,"seconds":127,"captured":128,"cctv":129,"systems":130,"raised":131,"alert":132,"telematics":133,"data":134,"800":135,"commercial":136,"trucks":137,"exfiltrated":138,"over":139,"three":140,"weeks":141,"through":142,"exposed":143,"rest":144,"api":145,"endpoint":146,"lacked":147,"authentication":148,"stolen":149,"included":150,"gps":151,"tracks":152,"driver":153,"ids":154,"fuel":155,"consumption":156,"logs":157,"schedules":158,"breach":159,"discovered":160,"egress":161,"operator":162,"siem":163,"infotainment":164,"connected":165,"via":166,"media":167,"file":168,"loaded":169,"usb":170,"drive":171,"exploiting":172,"parsing":173,"vulnerability":174,"player":175,"gained":176,"root":177,"ecu":178,"point":179,"probe":180,"internal":181,"network":182,"segmentation":183,"prevented":184,"lateral":185,"movement":186,"beyond":187,"domain":188,"spoofed":189,"tpms":190,"broadcast":191,"false":192,"low":193,"pressure":194,"four":195,"tires":196,"test":197,"dashboard":198,"warning":199,"light":200,"activate":201,"inducing":202,"pull":203,"carried":204,"out":205,"software":206,"defined":207,"radio":208,"range":209,"40":210,"meters":211,"safety":212,"critical":213,"indicator":214,"v2x":215,"roadside":216,"unit":217,"broadcasting":218,"intersection":219,"assist":220,"messages":221,"found":222,"transmitting":223,"unauthenticated":224,"collision":225,"warnings":226,"passing":227,"active":228,"triggered":229,"emergency":230,"braking":231,"events":232,"controlled":233,"zone":234,"rsu":235,"physically":236,"installed":237,"unknown":238,"operated":239,"approximately":240,"hours":241,"":242}